@magodo thanks for testing this!

I've used your exact code and ran this against my tenant/subscription _(of course I added the object_id that is now running terraform to the IAM of the storage account as you've used the data block)_ and it does the same. It shows Import successful!, but yet doesn't show any state, other than the client_config.

Looking again in the logs I see this line;

'''
2023-11-20T15:01:52.379+0100 [DEBUG] Resource instance state not found for node "azurerm_role_assignment.table_contributor[\"0\"]", instance azurerm_role_assignment.table_contributor["0"]
'''

I even let terraform first apply my config to make sure I have the exact config the import needs to have and still it is not working;

```
Terraform will perform the following actions:

  # azurerm_role_assignment.table_contributor["0"] will be created
  + resource "azurerm_role_assignment" "table_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "18da3597-c653-400d-bc18-0a330c7a429e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = "/subscriptions/xxxx/resourceGroups/test-import-roleassignment/providers/Microsoft.Storage/storageAccounts/satestimportroleassign"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_role_assignment.table_contributor["0"]: Creating...
azurerm_role_assignment.table_contributor["0"]: Still creating... [10s elapsed]
azurerm_role_assignment.table_contributor["0"]: Still creating... [20s elapsed]
azurerm_role_assignment.table_contributor["0"]: Creation complete after 25s [id=/subscriptions/xxxx/resourceGroups/test-import-roleassignment/providers/Microsoft.Storage/storageAccounts/satestimportroleassign/providers/Microsoft.Authorization/roleAssignments/d28eab22-0589-2d2c-2ef5-4d8c3b1902ec]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

name = "18da3597-c653-400d-bc18-0a330c7a429e"
```

PS C:\test-import-role_assignment> terraform state list
```
data.azurerm_client_config.current
azurerm_role_assignment.table_contributor["0"]
```
PS C:\test-import-role_assignment> terraform import azurerm_role_assignment.table_contributor["0"] /subscriptions/xxxx/resourcegroups/test-import-roleassignment/providers/Microsoft.Storage/storageAccounts/satestimportroleassign/providers/Microsoft.Authorization/roleAssignments/18da3597-c653-400d-bc18-0a330c7a429e

```
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNGIwNzc5NS04ZGRiLTQ2MWEtYmJlZS0wMmY5ZTFiZjdiNDY7b2JqZWN0SWQ9ZGRjNzdhOWEtMjU0Zi00ZDZlLWFjYWUtNmFlOGJkMTI2NDNkO3N1YnNjcmlwdGlvbklkPTdmOWYxNjQzLThhYzktNDFiMy1hOTA4LTUxYTU4YmJhZTNjODt0ZW5hbnRJZD01ODNhMmJmYS1kYmM1LTQ5NDgtOWMyYS1lMGJmN2U1ZWE0M2Y=]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.
```

PS C:\Data\GitHub\testing\test-import-role_assignment> terraform state list                                                             
```
data.azurerm_client_config.current
```

Any idea on what is different in your setup?
What is `1527e40e-cfa2-ec7a-ed87-2bf594244211` in your setup? The object_id of the object you've added to the IAM or the ID from the resource ID of the role assignment? (eg;  "id": "/subscriptions/xxxx/resourceGroups/test-import-roleassignment/providers/Microsoft.Storage/storageAccounts/satestimportroleassign/providers/Microsoft.Authorization/roleAssignments/**d28eab22-0589-2d2c-2ef5-4d8c3b1902ec**")